<h1 style='text-align: center'>SQL Queries</h1>

## Getting Data From A SQL Database

### The Structure of a SQL Query

<img src='images/sql_statement.jpg'/>

#### SELECT

- What columns of data do we want? 
- Specify by column names or * (All)

FROM
- Where are we getting our data from? 
- Specify by table name or use join statement to join multiple tables

##### JOIN

- Use to join multiple tables 
- SELECT * FROM students join favorite_foods on students.id = favorite_foods.student_id
- SELECT * FROM students as s join favorite_foods as f on s.id = f.student_id

#### WHERE

- apply some filter to the data you are querying 
- define criteria for data that should selected from the database 
- SELECT * from students WHERE age > 10

#### GROUP BY

- Group columns by similar values
- SELECT COUNT(id), city from students GROUP BY city

#### HAVING

- Use to apply filter AFTER you have made your initial query 
- When should we use HAVING instead of WHERE

In [3]:
import sqlite3

conn = sqlite3.connect('tutorial.db')
c = conn.cursor()

In [4]:
# Load students.json file

#your code here
import json
f=open('students.json','r')
data=json.load(f)

In [5]:
# iterate over the data and insert each student into the DB

In [6]:
data[0]

{'name': 'Sean Abu Wilson',
 'birthdate': '02/06',
 'siblings': 2,
 'Birthplace': 'Birmingham, AL',
 'yearsinnyc': 7.8,
 'favoritefood': 'guacamole'}

In [7]:
c.execute('''DROP TABLE student_info''')

In [8]:
c.execute('''CREATE TABLE IF NOT EXISTS student_info (name TEXT, birthdate TEXT, number_of_siblings INTEGER, birth_place TEXT, years_in_nyc INTEGER, favorite_food TEXT)''')

In [9]:
# dynamic data entry example
def dynamic_data_entry(person):


    c.execute('''INSERT INTO student_info (name, birthdate, number_of_siblings, birth_place, years_in_nyc, favorite_food) VALUES (?, ?, ?, ?, ?, ?)''', 
    (person['name'], person['birthdate'], person['siblings'], person['Birthplace'], person['yearsinnyc'], person['favoritefood']))
    
    conn.commit()




# c.close
# conn.close()
for i in data:
    dynamic_data_entry(i)

In [10]:
c.execute('''SELECT * from student_info''').fetchall()

[('Sean Abu Wilson', '02/06', 2, 'Birmingham, AL', 7.8, 'guacamole'),
 ('Tawab', '04/08/1998', 4, 'Afghanistan', 0.5, 'pizza'),
 ('Bridget Boakye', '1990-07-13', 3, 'Accra', 15, 'Indian'),
 ('Cristina', '9/9/1990', 2, 'Spain', 6, 'Sushi'),
 ('Danny (Haoyang) Yu', '1997-03-19', 2, '1997-03-19', 0, 'Galbi'),
 ('Dustin_Breitner', '04/15/94', 2, 'New_York', 3, 'Pizza'),
 ('Gregory DeSantis', '1987-11-23', 2, 'Highland Park, NJ', 13, 'Pizza'),
 ('Harrison Miller', '10/2/85', 0, 'New Jersey', 0, 'Pizza'),
 ('Jeremy Owens', '03/30/1990', 0, 'Virginia', 6, 'Avocado'),
 ('Jeremy Reikes', '1-/12/1995', 1, 'New York City', 23, 'Pizza'),
 ('Johnathan Peck', '02-19-1994', 2, 'New York', 25, 'Moms food'),
 ('Minna F', '11-19-1996', 3, 'San Francisco', 1, 'sushi'),
 ('Nabil Abbas', '12-07-1994', 2, 'Long Island', 6, 'Gyro'),
 ('Natalie Del Rossi', '10-23-1994', 0, 'Brooklyn', 18, 'pizza'),
 ('Remy Canario', '10-11-1988', 0, 'New York', 28, 'toast'),
 ('Xristos Katsaros', '03-24-1986', 1, 'Chicago Heights, IL', 3, 'Pizza')]

### Questions
1. What are the names of all of the students?
2. Which student has the most siblings?
3. How many students are only children?
4. Which 3 students have lived in NYC the shortest amount of time?
5. How many students are native New Yorkers?
6. Do any two students have the same favorite food?
7. Which student was born closest to the cohort's graduation date?

In [11]:
c.execute('''SELECT name from student_info''').fetchall()

[('Sean Abu Wilson',),
 ('Tawab',),
 ('Bridget Boakye',),
 ('Cristina',),
 ('Danny (Haoyang) Yu',),
 ('Dustin_Breitner',),
 ('Gregory DeSantis',),
 ('Harrison Miller',),
 ('Jeremy Owens',),
 ('Jeremy Reikes',),
 ('Johnathan Peck',),
 ('Minna F',),
 ('Nabil Abbas',),
 ('Natalie Del Rossi',),
 ('Remy Canario',),
 ('Xristos Katsaros',)]

In [12]:
c.execute("""SELECT name FROM student_info WHERE number_of_siblings =(SELECT max(number_of_siblings) FROM student_info)""").fetchall()

[('Tawab',)]

In [14]:
c.execute('''SELECT COUNT(name) FROM student_info WHERE number_of_siblings = 0''').fetchall()

[(4,)]

In [15]:
c.execute("""SELECT name FROM student_info ORDER BY years_in_nyc ASC limit 3 """).fetchall()

[('Danny (Haoyang) Yu',), ('Harrison Miller',), ('Tawab',)]

In [22]:
c.execute("""SELECT count(name) FROM student_info WHERE birth_place in ('New York','New_York','Long Island','Brooklyn') """).fetchall()

[(5,)]

In [25]:
c.execute("""SELECT COUNT(name) FROM student_info WHERE birth_place like '%York%'""").fetchall()

[(4,)]

In [27]:
c.execute("""SELECT favorite_food, count(*) FROM student_info 
Group BY favorite_food HAVING count (*) > 1""").fetchall()

[('Pizza', 5), ('pizza', 2)]

In [28]:
c.execute("""SELECT favorite_food,count (*) FROM student_info GROUP BY favorite_food COLLATE NOCASE HAVING count(*) >1""").fetchall()

[('pizza', 7), ('Sushi', 2)]

In [17]:
c.execute("""SELECT name FROM student_info ORDER BY years_in_nyc ASC LIMIT 3""").fetchall()

[('Danny (Haoyang) Yu',), ('Harrison Miller',), ('Tawab',)]